Revit 2027 API
BuiltInFailures.MEPCalculationFailures.FlowAndPressureCalculationMethodHasBeenImproved Property
 During upgrade pressure drop calculations for hydronic piping systems using Simplified Colebrook or Custom Calculation methods have been recalculated using the Colebrook equation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FlowAndPressureCalculationMethodHasBeenImproved { get; }
Public Shared ReadOnly Property FlowAndPressureCalculationMethodHasBeenImproved As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FlowAndPressureCalculationMethodHasBeenImproved {
	FailureDefinitionId^ get ();
}
static member FlowAndPressureCalculationMethodHasBeenImproved : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace